{
    "Recipe for a dessert with cream cheese in it": [
        "cream cheese",
        "dessert"
    ],
    "I want some greasy appetizers while I watch the superbowl, can I have a recipe similar to appetizers I would find at a cheap pub?": [
        "appetizers",
        "cheap pub",
        "greasy",
        "superbowl"
    ],
    "Can I get a healthy vegan burger entree?": [
        "entree",
        "healthy",
        "vegan"
    ],
    "How do I make barbequed ribs using Tabasco?": [
        "Tabasco",
        "barbequed ribs"
    ],
    "Would I be able to get a breakfast recipe with seafood if eating dairy makes me sick and I only have a bbq to cook on?": [
        "bbq",
        "healthy",
        "seafood"
    ],
    "Can I get a recipe for a fruit drink with a kick and isn't too sugary?": [
        "fruit drink",
        "kick",
        "not too sugary"
    ],
    "I want a kebab that isn't meat": [
        "kebab",
        "not meat"
    ],
    "I'm looking for avocado based baby food": [
        "avocado",
        "baby food"
    ],
    "Can I make an Asian dessert using red bean?": [
        "Asian",
        "dessert"
    ],
    "I want to eat lunch at my office desk but I'm worried that the smell of my food will affect my colleagues": [
        "colleagues",
        "desk",
        "food",
        "office",
        "smell"
    ],
    "What's a good warm dish to make for my kids who are sick with the flu?": [
        "flu",
        "warm dish"
    ],
    "What's a smoothie with plenty of fruits I can make for my kid's party?": [
        "fruits",
        "kid's party",
        "smoothie"
    ],
    "Whats a marinade I could make to make my ribeye taste like a keg entree?": [
        "entree",
        "keg",
        "marinade"
    ],
    "I want to make a korean dish with no kimchi": [
        "Korean",
        "dish"
    ],
    "I don't know how to use caviar to make anything other than canapes - how do I use it in a main course?": [
        "canapes",
        "caviar",
        "main course"
    ],
    "How to make loaded potato salad without sour cream?": [
        "loaded potato salad",
        "without sour cream"
    ],
    "I want some savory Chinese festival food": [
        "Chinese",
        "festival",
        "food",
        "savory"
    ],
    "Show me a recipe for savoury crepes": [
        "recipe",
        "savoury crepes"
    ],
    "I want a snack that's sweet like candy": [
        "candy",
        "sweet"
    ],
    "I want to make something warm with chili peppers": [
        "chili peppers",
        "warm"
    ],
    "Can I have a recipe for barbecue meat, but not seafood?": [
        "barbecue",
        "meat"
    ],
    "I want to make a fruit dessert for my girlfriend but lactose makes her stomach hurt, and she only likes expensive fruits": [
        "expensive",
        "expensive fruit",
        "fruit dessert",
        "girlfriend",
        "lactose",
        "stomach hurt"
    ],
    "What's a good dinner recipe if I want to build up my muscles?": [
        "build up muscles",
        "dinner",
        "healthy"
    ],
    "My grandparents friends are coming over for dinner, can I get an entree recipe that's easy on the teeth?": [
        "easy on the teeth",
        "entree"
    ],
    "This year, I want to make standard Christmas candies": [
        "candies",
        "standard"
    ],
    "What's a pasta recipe that doesn't contain meat?": [
        "meat-free",
        "pasta"
    ],
    "I want a hearty dish that has carrots": [
        "carrots",
        "hearty"
    ],
    "I'm allergic to eggs but want to make a cake": [
        "allergic",
        "cake",
        "eggs"
    ],
    "My favourite dessert is ice cream but I don't like fruity flavours": [
        "fruity",
        "ice cream"
    ],
    "How to make berry jam at home?": [
        "at home",
        "berry jam"
    ],
    "I want to make a sauce that goes with my ham": [
        "ham",
        "sauce"
    ],
    "My son is having an Incredibles themed birthday party tonight, and I want to make a dinner recipe similar to the leftover night dinner scene shown in the movie": [
        "Incredibles",
        "dinner",
        "leftover night dinner",
        "recipe"
    ],
    "I want to make a weight loss friendly dessert": [
        "dessert",
        "weight loss friendly"
    ],
    "I have some extra milk and I want to use it for baking": [
        "baking",
        "milk"
    ],
    "I need a breakfast that won't trigger my Celiac disease": [
        "breakfast",
        "won't trigger my Celiac disease"
    ],
    "I want a drink with chocolate or cinnamon for a cosy night in": [
        "chocolate",
        "cinnamon",
        "drink"
    ],
    "I have a vegan friend coming over to have dinner and I want to make an inclusive pasta recipe": [
        "inclusive",
        "pasta",
        "vegan"
    ],
    "I need a healthy preworkout snack and I can't be too full": [
        "healthy",
        "preworkout",
        "snack"
    ],
    "How do I make halal Chinese fried noodle?": [
        "Chinese fried noodle",
        "halal"
    ],
    "I'm trying to increase my protein intake but cut down on my fat intake to get leaner": [
        "fat",
        "lean",
        "protein"
    ],
    "How do I make a banana split ice cream dessert for my kids?": [
        "banana split",
        "dessert",
        "ice cream"
    ],
    "I want something similar to Chipotle and also healthy": [
        "Chipotle",
        "healthy"
    ],
    "I want to cook a simple lunch but I'm trying to lose weight": [
        "healthy",
        "lunch",
        "simple"
    ],
    "I want a baby food recipe that contains a variety of vitamins from natural sources, such as fruits": [
        "baby food",
        "natural sources",
        "vitamins"
    ],
    "I pack my lunch for school every day but I hate the hassle of bringing multiple containers": [
        "container",
        "lunch",
        "school"
    ],
    "I want a pasta that doesn't taste cheap.": [
        "cheap",
        "pasta"
    ],
    "Could I have some sweet dim sum?": [
        "dim sum",
        "sweet"
    ],
    "I want to make those easter chocolate creme eggs at home": [
        "chocolate creme eggs",
        "easter"
    ],
    "I really need to cut down on my weight, all the snacks I eat are too unhealthy. What snack recipes can I make with vegetables?": [
        "healthy",
        "snack",
        "vegetables"
    ],
    "I'm vegan but I miss eating steak": [
        "steak",
        "vegan"
    ],
    "Do you have a Kosher meat recipe for Shabbat?": [
        "Kosher",
        "meat"
    ],
    "I want to make an Italian vegan dish": [
        "Italian",
        "dish",
        "vegan"
    ],
    "What are ways to cook asparagus if I don't have an oven at home?": [
        "asparagus",
        "ways to cook"
    ],
    "I need some recipe ideas for snacks I can send with my daughter to bring to school": [
        "healthy",
        "recipe ideas",
        "snack"
    ],
    "How do I make pan-fried noodles with seafood?": [
        "noodles",
        "pan-fried",
        "seafood"
    ],
    "How do I cook green beans in the oven?": [
        "green beans",
        "oven"
    ],
    "I need to prepare a passionfruit punch bowl, although I don't think I'm able to find actual passionfruits in supermarkets near me": [
        "passionfruit",
        "punch bowl"
    ],
    "I want a salad rich with antioxidants": [
        "antioxidants",
        "salad"
    ],
    "I want to prepare a warm soup for my sick friend, and I need to consider the fact that he is vegan": [
        "sick friend",
        "soup",
        "vegan"
    ],
    "I miss the egg tarts I had in Asia": [
        "Asia",
        "egg tarts"
    ],
    "I need some recipe ideas for appetizers I can make on my barbeque": [
        "appetizers",
        "recipe ideas"
    ],
    "At my job site I don't have any shade to store my food. What are some snack recipes that can last all day exposed to the sun?": [
        "healthy",
        "recipes",
        "snack"
    ],
    "I would like a beef recipe but not stew": [
        "beef",
        "recipe"
    ],
    "I have a gluten allergy and I want to have dim sum for breakfast": [
        "breakfast",
        "dim sum",
        "gluten allergy"
    ],
    "How do I make a spicy soup with chicken?": [
        "soup",
        "spicy"
    ],
    "I want kebabs that are easy on the stomach": [
        "easy on the stomach",
        "kebabs"
    ],
    "I want to cook pasta but not tortellini": [
        "pasta",
        "tortellini"
    ],
    "Can I have a creamy fruit salad without kiwi?": [
        "creamy",
        "fruit salad",
        "kiwi"
    ],
    "It's my cheat day today and I'm craving some junk food for dinner": [
        "cheat day",
        "dinner",
        "junk food"
    ],
    "What's something that I can just warm up the next morning?": [
        "something",
        "warm up"
    ],
    "I want chicken wing appetizer that I can eat with my 83 year old grandpa, who has a weak heart": [
        "83 year old grandpa",
        "appetizer",
        "chicken wing",
        "weak heart"
    ],
    "I'm sick and tired of a traditional breakfast, would I be able to have a unique breakfast dish without eggs, bacon, or sausage?": [
        "breakfast dish",
        "unique"
    ],
    "Can I have a simple cheese pizza?": [
        "cheese pizza",
        "simple"
    ],
    "I'm on a paleo diet and want a breakfast I can grab and go": [
        "breakfast",
        "grab and go",
        "paleo"
    ],
    "Bacon breakfast recipe for beginners": [
        "bacon",
        "breakfast",
        "recipe"
    ],
    "I want foie gras served with a sweet condiment, jam, or sauce": [
        "foie gras",
        "jam",
        "sauce",
        "sweet condiment"
    ],
    "I'm going on a picnic, what's something I can make with all healthy ingredients?": [
        "healthy",
        "ingredients",
        "picnic"
    ],
    "I want a beef stew with at least two different vegetables": [
        "at least two different vegetables",
        "beef stew"
    ],
    "I want to make an Asian vegetable platter for brunch with my friends, what are some good recipes?": [
        "Asian",
        "vegetable platter"
    ],
    "I want a meat dish suitable for date night": [
        "date night",
        "meat"
    ],
    "I'm craving an egg-based dessert": [
        "egg-based dessert"
    ],
    "Give me a non-spicy hot pot recipe": [
        "hot pot",
        "non-spicy"
    ],
    "I'm craving a snack that is fried, yet still somewhat healthy": [
        "fried",
        "yet still somewhat healthy"
    ],
    "Do you have an idea for a vegetarian dish I can bring to a summer picnic?": [
        "picnic",
        "vegetarian"
    ],
    "What's a snack recipe containing cheddar cheese?": [
        "cheese",
        "snack"
    ],
    "I want a detox salad": [
        "detox",
        "salad"
    ],
    "I'm craving Asian style meat pancakes": [
        "Asian style meat pancakes"
    ],
    "Today's really hot and I'm craving for a peach flavoured treat": [
        "peach",
        "treat"
    ],
    "I want to make a hearty paleo stew for my grandchildren": [
        "hearty",
        "paleo",
        "stew"
    ],
    "I would like meat lasagna but I'm watching my weight": [
        "healthy",
        "meat lasagna",
        "weight"
    ],
    "I like eating pulled meats, but not beef or chicken": [
        "but not beef or chicken",
        "pulled meats"
    ],
    "Can I have something chocolate-hazelnut flavoured for breakfast?": [
        "breakfast",
        "chocolate",
        "hazelnut"
    ],
    "Give me a recommendation for a drink people usually bring to the gym": [
        "drink",
        "healthy"
    ],
    "I need to prepare a meal for my friend who's diabetic": [
        "diabetic",
        "meal"
    ],
    "What should I make to treat my parents for the new year? They aren't familiar with anything not American or European so I want to lean towards something safe": [
        "safe",
        "traditional",
        "treat"
    ],
    "How can I eat caviar with crackers?": [
        "caviar",
        "crackers"
    ],
    "Give me a halal salad recipe": [
        "halal",
        "salad"
    ],
    "How to make noodles like Chinese takeaway?": [
        "noodles",
        "takeaway"
    ],
    "I'd like to have a halloween themed snack for my halloween party.": [
        "halloween",
        "snack"
    ],
    "I need breakfast but I have no cooking experience": [
        "breakfast",
        "no cooking experience"
    ],
    "I want muffins for breakfast but I'm out of butter": [
        "butter",
        "muffins"
    ],
    "I want to make ribs but I don't have a grill": [
        "grill",
        "ribs"
    ],
    "I want a vegetarian meal that still gets me the nutrients I would get with meat": [
        "main course",
        "vegetarian"
    ],
    "I have a cold and feel dehydrated, what's a recipe I can make for lunch that will help me feel better?": [
        "dehydrated",
        "recipe"
    ],
    "How to make rice in a pan?": [
        "how to make",
        "pan",
        "rice"
    ],
    "Can I have a steak recipe that's similar to what my Floridian friends would eat?": [
        "Floridian",
        "Floridian",
        "Floridian",
        "similar to Floridian",
        "steak"
    ],
    "I want to make paella for my spanish mother-in-law who is diabetic": [
        "diabetic",
        "mother-in-law",
        "paella",
        "spanish"
    ],
    "What's the most simple meal I can make using just a rice cooker?": [
        "rice cooker",
        "simple meal"
    ],
    "I would like a lunch dish that's spicy": [
        "dish",
        "spicy"
    ],
    "What foods should I prepare for my one year old to eat for lunch?": [
        "food",
        "healthy",
        "lightweight"
    ],
    "My friends are coming over to watch a football game and I want to bake a filling appetizer": [
        "appetizer",
        "filling"
    ],
    "I'm craving something with gingerbread - like cookies or tarts!": [
        "cookies",
        "gingerbread",
        "tarts"
    ],
    "I am allergic to nuts, what are some good braised pork entree recipes?": [
        "braised",
        "entree",
        "pork"
    ],
    "I want to emulate the fine dining experience at home with expensive seafood.": [
        "expensive",
        "fine dining",
        "seafood"
    ],
    "What snack can I eat if I just got braces?": [
        "healthy",
        "snack"
    ],
    "I'm a Kenyan long distance runner and I want a main dish full of protein from my hometown": [
        "Kenyan",
        "main dish"
    ],
    "I can't handle spicy food and I would like a lemon chicken entree recipe": [
        "lemon chicken",
        "spicy"
    ],
    "Can I get a scallop entree recipe that has bacon, and is similar to an entree you could get at red lobster?": [
        "bacon",
        "entree",
        "scallop"
    ],
    "I'm looking for a Christmas themed snack that will keep the kids busy and out of my way": [
        "Christmas",
        "snack"
    ],
    "Can I have a banana bread recipe that contains nuts?": [
        "banana bread",
        "nuts"
    ],
    "I want to make dinner rolls with some extra flavour in it": [
        "dinner",
        "extra flavour",
        "rolls"
    ],
    "I want to cook noodles in a wok": [
        "noodles",
        "wok"
    ],
    "I would like to make either apple or cherry pie for dessert": [
        "apple",
        "cherry pie"
    ],
    "Could I have a fruit salad containing a variety of fruits?": [
        "fruit salad",
        "variety of fruits"
    ],
    "It's a cold evening and I want German food": [
        "German food",
        "cold evening"
    ],
    "I'm going camping, so I need a recipe such that its ingredients won't spoil when kept in room temperature for three days.": [
        "ingredients",
        "recipe",
        "room temperature",
        "three days"
    ],
    "Can I have a chocolate smoothie without any fruits, berries, or grains?": [
        "berries",
        "chocolate smoothie",
        "fruits",
        "grains"
    ],
    "I want a creamy pasta": [
        "creamy",
        "pasta"
    ],
    "I want a healthier breakfast omelette I can make quickly before work": [
        "breakfast",
        "healthy",
        "omelette",
        "quick"
    ],
    "I would like to make a pear cake for dessert but I'm a beginner at baking": [
        "dessert",
        "pear cake"
    ],
    "What's a lobster recipe without too many ingredients?": [
        "lobster",
        "recipe"
    ],
    "I would like to make a traditional chicken entree that's greek-inspired": [
        "chicken",
        "greek-inspired"
    ],
    "How do I make a slushie without artificial flavouring?": [
        "slushie",
        "without artificial flavouring"
    ],
    "I want a meat lovers pasta recipe to make for dinner when hosting my American friends": [
        "meat lovers",
        "pasta",
        "recipe"
    ],
    "I want a japanese dish with no carbs": [
        "japanese",
        "no carbs"
    ],
    "What snack can I have if I am allergic to soy?": [
        "healthy",
        "snack",
        "soy free"
    ],
    "I miss Australian damper": [
        "Australian",
        "damper"
    ],
    "The chicken I brought is about to expire, and I want to use it in a soup": [
        "chicken",
        "soup"
    ],
    "My family wants a recipe for peach cobbler that's healthier": [
        "healthier",
        "peach cobbler"
    ],
    "What are some meals I could have after high intensity exercise for muscle gain?": [
        "high intensity exercise",
        "meals",
        "muscle gain"
    ],
    "Any ideas for dye-free green desserts for St Patrick's day?": [
        "St Patrick's day",
        "dessert",
        "dye-free",
        "green"
    ],
    "I want to make a dessert with my brown rice": [
        "brown rice",
        "dessert"
    ],
    "I'm craving a nut flavoured ice cream, maybe something like white chocolate macadamia or peanut butter": [
        "flavoured",
        "ice cream",
        "macad",
        "maybe",
        "nut",
        "white chocolate"
    ],
    "I need to prepare a lunch to eat in the car after my training session at the gym": [
        "car",
        "lunch",
        "training"
    ],
    "I want to make an Asian dish with pork and rice": [
        "Asian",
        "pork",
        "rice"
    ],
    "Give me some bread recipes that are low in fat": [
        "bread",
        "low fat",
        "recipes"
    ],
    "I want to make use of the extra bottle of beer I have to bake some bread": [
        "beer",
        "bread",
        "bread",
        "bread",
        "bread",
        "bread",
        "bread",
        "bread"
    ],
    "What can I make for a European-inspired breakfast?": [
        "European",
        "breakfast"
    ],
    "What's a breakfast dish containing meat that I can make if I'm not in a rush?": [
        "breakfast",
        "dish",
        "meat"
    ],
    "Can I have a recipe for fried seafood?": [
        "fried seafood",
        "recipe"
    ],
    "Recipes for lemon cake like the ones from Starbucks": [
        "Starbucks",
        "lemon cake"
    ],
    "I want to try making some vegan Japanese desserts": [
        "Japanese",
        "dessert",
        "vegan"
    ],
    "How to easily make homemade yogurt?": [
        "homemade",
        "yogurt"
    ],
    "I want to cook polish sausage with sauerkraut": [
        "polish sausage",
        "sauerkraut"
    ],
    "Give me some pineapple recipes that aren't dessert": [
        "pineapple",
        "recipes"
    ],
    "I'm on a diet and I'm craving dandan noodles": [
        "craving",
        "dandan noodles",
        "diet"
    ],
    "I think baking and decorating Christmas cookies this weekend sounds like a fun idea": [
        "Christmas",
        "cookie",
        "fun"
    ],
    "I hate it when my sandwiches make a huge mess after eating it": [
        "mess",
        "sandwich"
    ],
    "Can I get a soup recipe that contains chicken or beef and other ingredients that aren't vegetables?": [
        "beef",
        "chicken",
        "other ingredients",
        "soup"
    ],
    "Do you have some vegan friendly dinner ideas": [
        "dinner",
        "vegan friendly"
    ],
    "I want a winter holiday drink but not something that's too sweet": [
        "drink",
        "holiday"
    ],
    "I'm really craving seafood spaghetti, can I have a recipe for that?": [
        "recipe",
        "seafood spaghetti"
    ],
    "I had a long day at work, can I have a dinner recipe that isn't too hard to make?": [
        "dinner",
        "recipe"
    ],
    "What can I make with frozen berries that's not a drink?": [
        "berries",
        "drink"
    ],
    "I'm craving a light snack but I would prefer something salty over something sweet": [
        "salty",
        "snack"
    ],
    "What is a hearty French dish I can make for dinner?": [
        "French",
        "dinner",
        "hearty"
    ],
    "Is there a filling Canadian main course that's not poutine": [
        "Canadian",
        "filling",
        "main course"
    ],
    "What are some fermented vegetables I can make to store during the winter?": [
        "fermented",
        "vegetables",
        "winter"
    ],
    "I'm allergic to dairy but I really love ice cream": [
        "dairy",
        "ice cream"
    ],
    "How do I spice up my instant noodles? I'm bored of following the plain recipe on the packaging": [
        "instant",
        "noodles",
        "spicy"
    ],
    "I want a dessert recipe for brownies and fudge that I won't feel bad about eating on my diet": [
        "brownies",
        "dessert",
        "diet",
        "fudge"
    ],
    "I want to make a halal stir-fried Chinese dish": [
        "Chinese",
        "dish",
        "halal",
        "stir-fried"
    ],
    "How do I cook a zucchini in the oven?": [
        "oven",
        "zucchini"
    ],
    "I want a French dish to go with a nice glass of red wine": [
        "French",
        "glass",
        "red wine"
    ],
    "I would like some strawberry breakfast recipes": [
        "breakfast recipes",
        "strawberry"
    ],
    "I want a thick and spicy chicken soup recipe": [
        "chicken soup",
        "thick and spicy"
    ],
    "My brother's birthday is coming up but he is picky and only likes the most traditional birthday cake": [
        "birthday cake",
        "traditional"
    ],
    "I want vegetables for a breakfast meal": [
        "breakfast",
        "vegetables"
    ],
    "I want a pasta recipe for dinner that is Greek instead of Italian for when it's hot outside and we don't want hot food": [
        "Greek",
        "pasta",
        "when it's hot outside and we don't want hot food"
    ],
    "I want to use up the corn in my fridge for a warm dish": [
        "corn",
        "dish",
        "warm"
    ],
    "Get me a dessert recipe that is digestion friendly": [
        "dessert",
        "digestion friendly"
    ],
    "I can't eat lactose, and don't have a lot of time in the morning to make food - would I be able to have a quick breakfast recipe?": [
        "breakfast",
        "quick",
        "recipe"
    ],
    "What are some traditional Chinese new year dishes?": [
        "dishes",
        "new year",
        "traditional Chinese"
    ],
    "I'm from Beijing and I want a meat dish from my country": [
        "Beijing",
        "meat dish"
    ],
    "I'm looking to host a traditional British-style Sunday roast in my backyard this weekend": [
        "Sunday roast",
        "backyard",
        "traditional",
        "weekend"
    ],
    "I want a recipe for something I can bake that's oil-free": [
        "oil-free",
        "recipe"
    ],
    "I need an easy meal under 10 dollars": [
        "easy",
        "under 10 dollars"
    ],
    "I'm recovering from a wisdom tooth extraction, give me something healthy to eat": [
        "extract",
        "healthy",
        "tooth"
    ],
    "I'm in a rush to go to school this morning, what should I make?": [
        "healthy",
        "lunch",
        "quick"
    ],
    "I want to make a sweet milkshake for the kids": [
        "kids",
        "sweet milkshake"
    ],
    "I'm craving a hamburger with a juicy beef patty": [
        "beef patty",
        "hamburger"
    ],
    "What's a fried food that isn't too bad for my heart?": [
        "fried food",
        "not too bad for my heart"
    ],
    "I need new menu items that are easy for takeout for my noodle restaurant": [
        "easy",
        "menu",
        "takeout"
    ],
    "I'm looking for a way to introduce a source of greens into my kids' diets": [
        "greens",
        "kids' diets"
    ],
    "Do you have a cookie recipe that's good for someone with a nut allergy?": [
        "cookie",
        "nut allergy",
        "yes"
    ],
    "What are some meals I can keep in the freezer for a week?": [
        "healthy",
        "meals",
        "week"
    ],
    "I want to bake a sweet lemon tart": [
        "lemon tart",
        "sweet"
    ],
    "I want a diabetes friendly dessert": [
        "dessert",
        "diabetes friendly"
    ],
    "I'm looking for pretty macarons that match the Easter pastel colour theme": [
        "Easter pastel",
        "macarons",
        "theme"
    ],
    "My roommate only eats western food and I'm about to cook dinner for the two of us": [
        "dinner",
        "roommate",
        "western food"
    ],
    "I'm sick of desserts that sacrifice flavor to be healthy. Can you suggest some nutty brownie dessert recipes?": [
        "brownie",
        "dessert",
        "nutty"
    ],
    "I want to make a Peruvian dessert for my dinner guests": [
        "Peruvian",
        "dessert"
    ],
    "Can I get a french toast recipe with fruit for breakfast?": [
        "french toast",
        "fruit"
    ],
    "My toddler's birthday party is next week and I want to prepare a fried snack that all his friends will love": [
        "fried",
        "snack"
    ],
    "Can I get a recipe for easy to make beef stew that won't affect my diet?": [
        "beef stew",
        "diet",
        "easy to make"
    ],
    "I have some chocolate, what french dessert can I make with it?": [
        "chocolate",
        "dessert"
    ],
    "What healthy fruit smoothie recipes can I make for lunch with my bookclub members who really track calories?": [
        "calories",
        "fruit smoothie recipes"
    ],
    "May I have a chicken recipe that contains bacon?": [
        "bacon",
        "chicken"
    ],
    "How to make pizza like the ones at Boston Pizza?": [
        "Boston Pizza",
        "pizza"
    ],
    "Give me a fruit cake recipe but I'm allergic to pineapple": [
        "allergy",
        "fruit cake",
        "pineapple"
    ],
    "I have way too many leftover chocolate candy bars from Halloween and I want to make a dessert": [
        "candy bars",
        "chocolate",
        "dessert"
    ],
    "I want some filling American food": [
        "American",
        "filling"
    ],
    "Ways to cook lamb with fragrant seasoning": [
        "fragrant",
        "lamb",
        "seasoning"
    ],
    "I have to use some eggs before they get bad, what's a noodle dish I can make?": [
        "bad",
        "eggs",
        "noodle dish"
    ],
    "Can I get a vegetable soup recipe that has some sort of meat?": [
        "meat",
        "soup"
    ],
    "I wanted to make myself a beef burger, similar to the one I had at Harvey's": [
        "beef burger",
        "similar to the one I had at Harvey's"
    ],
    "I want some mushy peas to go with my steak and kidney pie": [
        "kidney pie",
        "mushy peas",
        "steak"
    ],
    "I have leftover ground pork and I want to make Asian food": [
        "Asian",
        "ground pork"
    ],
    "My grandma is coming over for Thanksgiving dinner and I remember from last year that she hates cranberry sauce": [
        "cranberry sauce",
        "hates"
    ],
    " I would like a shrimp recipe and I'm trying to eat a balanced diet": [
        "balanced diet",
        "shrimp"
    ],
    "I want a savoury snack after school, but I can't be too full because I'll be eating dinner soon": [
        "savoury",
        "snack"
    ],
    "I want cheap swiss food": [
        "cheap",
        "swiss"
    ],
    "I want to cook Greek cuisine but I forgot to buy cheese, tzatziki dip, or garlic": [
        "Greek",
        "cheese",
        "cuisine",
        "garlic",
        "tzatziki dip"
    ],
    "I want a tropical fruit drink that reminds me of Hawaii": [
        "drink",
        "tropical fruit"
    ],
    "For lunch, I want to cook a duck French-style": [
        "French-style",
        "duck"
    ],
    "I want a green smoothie to have after my workout": [
        "after workout",
        "green smoothie"
    ],
    "I want a spanish dish that doesn't contain seafood": [
        "dish",
        "not",
        "seafood",
        "spanish"
    ],
    "I thought that preparing something on skewers would be a fun idea for a backyard barbeque.": [
        "barbeque",
        "fun",
        "skewers"
    ],
    "I heard eating at night makes you gain weight, but I need something to eat even if it is really light": [
        "healthy",
        "lightweight",
        "night",
        "snack"
    ],
    "Can I get a simple nut-free coleslaw side dish, nothing extra?": [
        "coleslaw",
        "side dish"
    ],
    "I miss my mom's noodle soup, is there a recipe for that?": [
        "noodle soup",
        "traditional"
    ],
    "I want to try making nordic dessert": [
        "dessert",
        "nordic"
    ],
    "How do I make garlic bread that's cheesy?": [
        "cheesy",
        "garlic bread"
    ],
    "What is a cod entree I could make that's not a soup or stew?": [
        "cod",
        "entree"
    ],
    "I would like a vegan banana bread recipe for brunch, however I'm allergic to nuts and I don't like chocolate": [
        "banana bread",
        "brunch",
        "vegan"
    ],
    "I have a lot of apples, what can I bake with them?": [
        "apple",
        "dessert"
    ],
    "I want to make a healthy soup recipe for my family, what is a good recipe?": [
        "healthy",
        "soup"
    ],
    "Give me a dairy-free milkshake recipe": [
        "dairy-free",
        "milkshake"
    ],
    "What are some cocktails that can make me feel like I'm on an island vacation?": [
        "cocktails",
        "island vacation"
    ],
    "I want to make a fancy grilled fish entree": [
        "entree",
        "fancy",
        "fish",
        "grilled"
    ],
    "I'm from Capetown and I want to introduce my vegetarian friend to cuisine from my country": [
        "Capetown",
        "cuisine",
        "vegetarian"
    ],
    "It is surprisingly difficult to find snacks that don't contain peanuts at the supermarket, so I think I'll have to resort to making my own": [
        "peanut-free",
        "snacks"
    ],
    "I want to make a paella but I'm short on time": [
        "paella",
        "traditional"
    ],
    "What's a drink I can make containing chocolate?": [
        "chocolate",
        "drink"
    ],
    "My cousins are vegetarian and they are coming over for mexican food night": [
        "mexican food night",
        "vegetarian"
    ],
    "I want have some diabetes friendly cookies": [
        "cookies",
        "diabetes friendly"
    ],
    "I would like a recipe for salad with yogurt dressing": [
        "salad",
        "yogurt dressing"
    ],
    "My daughter told me she wants a cake with a lots of cream for her birthday, but my oven is broken - what should I do?": [
        "broken",
        "cake",
        "cream",
        "oven"
    ],
    "I would like something cheap but I get hungry all the time": [
        "I get hungry all the time",
        "cheap"
    ],
    "I'd like to make a classic French fruit tart but I don't like raspberries": [
        "classic",
        "raspberry",
        "tart"
    ],
    "I want to make pancakes but most recipes out there contain wheat": [
        "pancakes",
        "wheat"
    ],
    "I would like lunch recipes with beans but not spicy": [
        "beans",
        "not spicy"
    ],
    "I want a nutritious meal to be in good shape for a marathon": [
        "marathon",
        "meal",
        "nutritious"
    ],
    "Can I have a shrimp pasta recipe for someone with low spice tolerance?": [
        "low spice tolerance",
        "shrimp pasta"
    ],
    "I want chicken that has a kick to it": [
        "chicken",
        "kick"
    ],
    "What are the best fall inspired pastries and baked goods?": [
        "baked goods",
        "fall",
        "pastries"
    ],
    "I'd like a cucumber recipe where the cucumbers aren't cooked": [
        "cucumber",
        "recipe"
    ],
    "What are some snacks I can eat on the sofa without making a mess?": [
        "healthy",
        "snack"
    ],
    "I want to make an italian snack": [
        "italian",
        "snack"
    ],
    "I'm craving something sweet and sour, what can I make?": [
        "something",
        "sweet and sour"
    ],
    "I like to try flavors that seem weird and unconventional, would I be able to have a soup recipe with cheese and alcohol?": [
        "alcohol",
        "cheese",
        "soup",
        "unconventional",
        "weird"
    ],
    "My best friend called and asked me if I could prepare something sweet for her bridal shower brunch": [
        "bridal shower",
        "brunch",
        "sweet"
    ],
    "I want to make popeyes style chicken at home": [
        "at home",
        "popeyes style chicken"
    ],
    "Can I have a meat stew recipe I can put on the stove and leave for a long time?": [
        "meat stew",
        "recipe"
    ],
    "Do you know how to cook bitter melon the Chinese way?": [
        "Chinese",
        "bitter melon"
    ],
    "What's a good broccoli side dish I can make for my young son who loves meat?": [
        "broccoli",
        "side dish"
    ],
    "I want a dip with vegetables to go with my tortilla chips for snack": [
        "dip",
        "snack",
        "vegetables"
    ],
    "Can I have some Japanese lunch box ideas?": [
        "Japanese",
        "lunch box"
    ],
    "Can you give me a vegan all day breakfast recipe?": [
        "breakfast",
        "vegan"
    ],
    "What are recipes for fish, but not baked in the oven?": [
        "but not baked in the oven",
        "fish"
    ],
    "I need an entree that would impress my client, who is a CEO of a multinational company": [
        "CEO",
        "entree",
        "impress",
        "multinational company"
    ],
    "What are some recipes containing corn that aren't too fat?": [
        "corn",
        "fat",
        "healthy"
    ],
    "What's a noodle dish I can make with a creamy sauce?": [
        "creamy",
        "sauce"
    ],
    "What are some refreshing drinks that are perfect for the hot summer?": [
        "hot summer",
        "refreshing"
    ],
    "What's a broccoli recipe that kids will like?": [
        "broccoli",
        "recipe"
    ],
    "What's a good hangover soup recipe?": [
        "hangover soup",
        "recipe"
    ],
    "I want to make a meatball appetizer for my party": [
        "appetizer",
        "meatball"
    ],
    "What's a spicy dish for someone who has lower spice tolerance?": [
        "dish",
        "spicy"
    ],
    "My kids want to use the new popsicle maker I bought": [
        "kids",
        "popsicle maker"
    ],
    "I want to make fries like the ones in McDonalds": [
        "fries",
        "like the ones in McDonalds"
    ],
    "I'm looking for decorative treats for my Halloween party": [
        "decorative",
        "treats"
    ],
    "I feel like having a breakfast pie that has sausage": [
        "breakfast pie",
        "sausage"
    ],
    "How do I cook the simplest stir fry with eggs and tomatoes?": [
        "eggs",
        "stir fry",
        "tomatoes"
    ],
    "I want to pack a savory Japanese lunch for my boyfriend": [
        "Japanese",
        "boyfriend",
        "savory"
    ],
    "I wanted to add some flavor to my homemade pizza": [
        "flavor",
        "homemade pizza"
    ],
    "How can I make some tasty yet affordable meals for a dinner date?": [
        "affordable",
        "dinner date",
        "tasty"
    ],
    "I wanted to make something salty to season my pea soup": [
        "salty",
        "season pea soup"
    ],
    "I want to make a sandwich at home similar to the ones from Subway": [
        "Subway",
        "sandwich"
    ],
    "What snack can I bring to the hospital for my friend who just had an appendectomy?": [
        "appendectomy",
        "snack"
    ],
    "I just need to prepare traditional Thanksgiving poultry, with no frills or anything too difficult": [
        "Thanksgiving",
        "poultry"
    ],
    "I want to make a Japanese soup that doesn't contain seaweed": [
        "Japanese",
        "soup"
    ],
    "I'm lacto-vegetarian and want a dish for dinner": [
        "dinner",
        "lacto-vegetarian"
    ],
    "What can I make for dinner using winter vegetables?": [
        "dinner",
        "winter vegetables"
    ],
    "I want dessert with dulce de leche for a hot summer day": [
        "dulce de leche",
        "summer day",
        "sweet"
    ],
    "I want some crispy chicken like what I could get at KFC": [
        "KFC",
        "crispy chicken"
    ],
    "I want to cook a gourmet dish with seafood": [
        "dish",
        "gourmet",
        "seafood"
    ],
    "I'm on a diet but I still want fish and chips": [
        "diet",
        "fish and chips"
    ],
    "I want curry but not indian or japanese": [
        "curry",
        "indian",
        "japanese"
    ],
    "I don't do well with dairy, but I want a loaded nacho appetizer to watch the game with": [
        "appetizer",
        "loaded",
        "nacho"
    ],
    "I want a lunch I can eat cold": [
        "cold",
        "lunch"
    ],
    "What beef recipe can I make if I like spicy food?": [
        "beef",
        "spicy"
    ],
    "I want to make a Chinese dessert with custard": [
        "Chinese dessert",
        "custard"
    ],
    "I want to try something warm to drink from West Africa": [
        "drink from West Africa",
        "warm"
    ],
    "What French appetizers use wine?": [
        "appetizers",
        "wine"
    ],
    "I want to avoid getting bloated so I can look good in my prom dress later, what should I eat for lunch?": [
        "healthy",
        "lightweight",
        "snack"
    ],
    "What is a side dish recipe that will set my mouth on fire?": [
        "set my mouth on fire",
        "side dish"
    ],
    "Can I have a recipe for grilled fish that's not tuna": [
        "fish",
        "recipe"
    ],
    "I want to prepare enough dinner for my family but we really need to save money right now": [
        "dinner",
        "family",
        "money"
    ],
    "I told my high school friends that I would be bringing a meat dish to the reunion potluck.": [
        "meat dish",
        "reunion potluck"
    ],
    "What are some non-standard flavors of ice cream I can make for my mom?": [
        "ice cream",
        "non-standard"
    ],
    "How to make a vegan lasagna for dinner?": [
        "lasagna",
        "vegan"
    ],
    "I want a soup that is a good for my bones since I have Osteoporosis": [
        "bones",
        "osteoporosis",
        "soup"
    ],
    "What are some desserts I can make for my dog?": [
        "dessert",
        "dog",
        "healthy"
    ],
    "I haven't been eating many vegetables this winter, can I get a drink recipe that will help me up my vegetable consumption?": [
        "drink",
        "vegetable",
        "winter"
    ],
    "Do you have a breakfast recipe for people with dysphagia?": [
        "breakfast",
        "recipe"
    ],
    "I want a casserole recipe with minimal hassle - my fridge is almost empty and I'm too lazy to go grocery shopping": [
        "casserole",
        "minimal hassle"
    ],
    "I want a dish with meat and I don't like vegetables": [
        "I don't like vegetables",
        "meat"
    ],
    "What's a good cheesecake recipe if I'm considering going keto?": [
        "cheesecake",
        "keto"
    ],
    "I'm looking for a vegan burger without tofu": [
        "burger",
        "vegan"
    ],
    "Could I have a potato recipe for my baby who is teething?": [
        "potato",
        "teething"
    ],
    "I'm craving German snacks": [
        "German",
        "snacks"
    ],
    "I want to try churros but I'm not a fan of cinnamon": [
        "churros",
        "cinnamon"
    ],
    "What can I make for breakfast using SPAM?": [
        "SPAM",
        "breakfast"
    ],
    "I want a keto dinner for weight loss": [
        "dinner",
        "keto"
    ],
    "Give me a sandwich recipe that's vegetarian": [
        "sandwich",
        "vegetarian"
    ],
    "I'm severely hungover and need to eat something solid, but I feel like I will throw up if the food is too greasy or soft": [
        "greasy",
        "soft",
        "solid",
        "throw up"
    ],
    "What pasta salad recipes can I make for a surprise lunch visit from friends?": [
        "friends",
        "pasta salad",
        "surprise"
    ],
    "I want an Indian dish that I can dip naan in": [
        "Indian",
        "dip naan",
        "naan"
    ],
    "I want vegan sushi": [
        "sushi",
        "vegan"
    ],
    "I'd love to have a milkshake but I'm lactose intolerant": [
        "lactose intolerant",
        "milkshake"
    ],
    "I want to make Chinese stir fry but I ran out of soy sauce": [
        "Chinese stir fry",
        "soy sauce"
    ],
    "Can I get a breakfast that's easy to eat on-the-go, like a wrap?": [
        "easy to eat",
        "wrap"
    ],
    "Can I have noodles but not Italian?": [
        "Italian",
        "noodles",
        "noodles"
    ],
    "I'm having bread sticks as an appetizer while I watch the superbowl, can I have a cheesy dip to go with it?": [
        "appetizer",
        "cheesy dip"
    ],
    "My father likes spicy food and I wanted to find a beef recipe that I could make for our family gathering this week": [
        "beef",
        "family gathering",
        "spicy"
    ],
    "Can I have a recipe for fish that's roasted?": [
        "fish",
        "roasted"
    ],
    "What meat dishes I can make using a campfire?": [
        "fire",
        "meat",
        "traditional"
    ],
    "I want a cheesy dip for my afternoon snack": [
        "afternoon snack",
        "cheesy dip"
    ],
    "I want to make butterbeer from Harry Potter that's also healthy": [
        "Harry Potter",
        "healthy"
    ],
    "I want a recipe for sweet potato fries that isn't too bad for me but still has flavor": [
        "flavor",
        "not too bad for me",
        "sweet potato fries"
    ],
    "Give me a Subway-style beef sandwich recipe": [
        "Subway-style beef sandwich recipe"
    ],
    "What can I make if I have butter and milk?": [
        "butter",
        "milk"
    ],
    "I want to make spicy chicken for my boyfriend and he doesn't like greasy food": [
        "chicken",
        "spicy"
    ],
    "I miss my mom's homemade Acadian dessert": [
        "Acadian dessert",
        "mom"
    ],
    "I want to make a soup from the Mediterranean": [
        "Mediterranean",
        "soup"
    ],
    "I want to make Caribbean cuisine for my kid so she can grow better": [
        "Caribbean",
        "grow better",
        "kid"
    ],
    "What are some fruit smoothie recipes that don't contain dairy?": [
        "dairy free",
        "fruit smoothie"
    ],
    "I ran out of flour but I promised my kids would bake them chocolate cake today": [
        "chocolate cake",
        "flour",
        "today"
    ],
    "What's a filling rice dish I can make?": [
        "filling",
        "rice dish"
    ],
    "Make chili that's not spicy": [
        "chili",
        "not spicy"
    ],
    "What are some interesting cake ideas for a baby boy gender reveal?": [
        "baby boy",
        "cake"
    ],
    "What side dishes can I barbeque along with the other main meat dish?": [
        "barbeque",
        "main dish",
        "meat",
        "side dishes"
    ],
    "I want a nice warm drink or dessert with fall spices": [
        "dessert",
        "fall spices",
        "warm drink"
    ],
    "I've been following a diet, can I have a chicken dinner recipe with low calorie count and isn't basic?": [
        "chicken",
        "low calorie count",
        "traditional"
    ],
    "I want to make a lunch I can bring to school from leftover Thanksgiving turkey": [
        "Thanksgiving",
        "leftover turkey",
        "lunch"
    ],
    "It's summer and I wanted to make something sweet that will help me cool down": [
        "cool down",
        "summer"
    ],
    "My kid isn't very adventurous and only likes plain ice cream, can I have a recipe for that?": [
        "ice cream",
        "plain"
    ],
    "I want to make Italian food for my daughter who hates cheese": [
        "Italian",
        "daughter",
        "food",
        "hates cheese"
    ],
    "What's a recipe for soup that's sweet?": [
        "soup",
        "sweet"
    ],
    "I want to make an egg-based finger food for a family reunion, can I have a good recipe?": [
        "egg",
        "finger food",
        "recipe"
    ],
    "What's a treat I can make for myself with milk during this heat wave?": [
        "milk",
        "treat"
    ],
    "I want cookies I can eat despite having a grain allergy": [
        "allergy",
        "cookies",
        "eat"
    ],
    "I would like a tomato recipe that isn't soup": [
        "recipe",
        "tomato"
    ],
    "How would I make fresh ramen noodles? I do not want to buy them from a store. Also, spicy food really hurts my stomach": [
        "ramen noodles",
        "spicy food",
        "stomach"
    ],
    "I want to show my brother that I can make nachos better than the keg, can I have a nacho recipe that is similar to a high end restaurant?": [
        "nacho",
        "similar to a high end restaurant"
    ],
    "Bacon is my favorite food for breakfast, and the consistency is really important to me. Would I be able to have a chewy bacon recipe?": [
        "bacon",
        "breakfast",
        "consistency"
    ],
    "How do I make cream puffs that don't have too many calories?": [
        "creamy",
        "puffs"
    ],
    "I want a salmon fish recipe and I haven't tried cumin on salmon before, but I would like to": [
        "cumin",
        "recipe",
        "salmon"
    ],
    "I want to make a pizza baguette": [
        "pizza baguette"
    ],
    "I want to try making Fijian dessert": [
        "Fijian dessert",
        "traditional"
    ],
    "I miss the local dessert I had near the Nile River": [
        "Nile River",
        "dessert"
    ],
    "I want to cook a korean dish with seafood": [
        "korean",
        "seafood",
        "traditional"
    ],
    "I work as a landscaper in the summer, so I don't have any way to refrigerate food. Can I have some snack recipes that I know won't spoil in the heat?": [
        "recipes",
        "snack",
        "won't spoil in the heat"
    ],
    "I want a recipe to make a lamb entree like I would be able to get at Milos greek restaurant": [
        "entree",
        "greek",
        "lamb"
    ],
    "What desserts can I have while on a budget?": [
        "budget",
        "dessert",
        "healthy"
    ],
    "I want to prepare a charcuterie board with cold cut meat for a picnic.": [
        "charcuterie board",
        "cold cut meat"
    ],
    "Can I have a brussel sprouts recipe with common ingredients?": [
        "brussel sprouts",
        "common ingredients"
    ],
    "I want a meal to eat before dawn in Ramadan": [
        "Ramadan",
        "breakfast"
    ],
    "My friend is bringing a bottle of champagne over, what should I make for dinner to go with it?": [
        "champagne",
        "dinner"
    ],
    "I want to prepare a Korean-style hot pot at home": [
        "Korean-style",
        "hot pot"
    ],
    "What is a sausage recipe for someone new to cooking?": [
        "recipe",
        "sausage"
    ],
    "I want a salad made with all organic ingredients": [
        "ingredients",
        "organic",
        "salad"
    ],
    "Can I have a recipe containing ground pork and beef?": [
        "beef",
        "ground pork"
    ],
    "I want a soup that is vitamin rich and healthy": [
        "healthy",
        "soup",
        "vitamin rich"
    ],
    "I want to make chips that are healthier than regular potato chips": [
        "healthier",
        "potato chips"
    ],
    "I want to cook a chicken entree on my new grill.": [
        "chicken",
        "entree"
    ],
    "I want to make a well-known Chinese chicken dish": [
        "Chinese",
        "chicken"
    ],
    "Can I have some cheap junk food?": [
        "cheap",
        "junk food"
    ],
    "I'd like a dumpling recipe that contains an unconventional meat": [
        "dumpling",
        "unconventional meat"
    ],
    "I want to prepare a chocolate fountain for the kids to eat strawberries with": [
        "chocolate",
        "fountain",
        "strawberries"
    ],
    "I want healthy Mexican food": [
        "Mexican food",
        "healthy"
    ],
    "Give me a low-glycemic dish for dinner": [
        "dish",
        "low-glycemic"
    ],
    "Can I have a recipe with green peppers and meat?": [
        "green peppers",
        "meat"
    ],
    "It's freezing and I'm a craving a thick soup": [
        "freezing",
        "thick soup"
    ],
    "What can I do with a leftover loaf of bread?": [
        "bread",
        "leftover"
    ],
    "I want fast food but my doctor says I shouldn't eat too much salty foods": [
        "fast food",
        "healthy",
        "salty"
    ],
    "My sons friend is coming over and he's highly allergic to nuts and dairy. What dessert could I make for him?": [
        "dairy-free",
        "dessert",
        "healthy",
        "nut-free"
    ],
    "I love cookies but most recipes out there are too unhealthy for my liking": [
        "cookies",
        "healthy",
        "unhealthy"
    ],
    "Can I have a brunch meal that's naturally sweet and doesn't take long to prepare?": [
        "brunch",
        "doesn't take long to prepare",
        "naturally sweet"
    ],
    "My son is skinny and wants to get bigger, what are some good snacks I could send with him to school?": [
        "healthy",
        "snack"
    ]
}